//Се внесува време во интернационална форма (4 вредности: час - од 1 до 12, минути – од 0 до 59, секунди – од 0 до 59,
//и знак А ако е од полноќ до претпладне или Р ако е од пладне до полноќ).
//Да се презентира времето во македонска форма во која 0 часот стои наместо 12 на полноќ, од 13 часот до 23 стојат за попладневните од 1 до 11 за претпладневните.
//Формата за точен излез може да се види во тест примерите.

#include <stdio.h>

int main()
{
    int h,m,s;
    char ampm,sp;
    scanf("%d%d%d", &h,&m,&s);
    scanf("%c", &sp);
    scanf("%c", &ampm);
    if (ampm == 'A')
    {
        if (h >=12)
        {
            printf("%02d:",h-12);
        } else {
            printf("%02d:", h);
        }
    } else if (ampm == 'P')
    {
        if (h<12)
        {
            printf("%02d:", h+12);
        }
        else
        {
            printf("%02d:", h);
        }
    }
    printf("%02d:%02d", m,s);
    return 0;
}
