//Постојат 4 сезони кои наизменично се менуваат: esen, zima, prolet, leto. Секој студент започнува да студира во есен, и понатаму продолжува во следните сезони.
//Ако за некој студент знаеме дека студирал 18 сезони, значи дека завршил во осумнаесеттата сезона, односно завршил со студирање во зима.
//Од тастатура се внесува даден природен број N (N<100) кој претставува број на студенти, и потоа се внесуваат N други природни броеви кои претставуваат
//по колку сезони студирал секој од N-те студенти.
//За секој од внесените броеви, во посебен ред, да се отпечати во која сезона завршил студентот.

#include <stdio.h>

int main()
{
    int n,i;
    scanf("%d", &n);
    for (i = 0; i<n; i++)
    {
        int sez, sezost;
        scanf("%d", &sez);
        sezost = sez%4;

        if (sezost == 3)
        {
            printf("prolet\n");
        } else if (sezost == 2)
        {
            printf("zima\n");
        }else if (sezost == 1)
        {
            printf("esen\n");
        }else if (sezost == 0)
        {
            printf("leto\n");
        }
    }
    return 0;
}
