//Од тастатура се внесува низа од целобројни елементи А со должина N ( N <= 100). Дополнително се внесува и број К.
//Да се трансформира низата така што на почеток ќе се преместат сите елементи помали од K, а после нив ќе следуваат броевите поголеми или еднакви на K.
//Редоследот на елементите да не се менува.
//Испечатете ги елементите на трансформираната низа во еден ред на стандарден излез разделени со празно место.

#include <stdio.h>
#define MAX 100

int main() {
    int a[MAX], n, i, k, atran[MAX] = {0};
    scanf("%d", &n);

    for (i = 0; i < n; i++) {
        scanf("%d", &a[i]);
    }
    scanf("%d", &k);

    int index = 0;
    for (i = 0; i < n; i++) {
        if (a[i] < k) {
            atran[index] = a[i];
            index++;
        }
    }

    for (i = 0; i < n; i++) {
        if (a[i] >= k) {
            atran[index] = a[i];
            index++;
        }
    }

    for (i = 0; i < n; i++) {
        printf("%d ", atran[i]);
    }
    return 0;
}