//Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:
//
//индекс (шестцифрен цел број)
//шест оценки од последниот семестар кој го слушал
//Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот: (погледнете во тест примерите за форматот на печатење)
//
//просек на студентот
//-просекот да се испечати со точност од 3 децимали
//-година на студии
//студентите чијшто индекс почнува на 21 се втора година, 20 се трета година, 19 се четврта година итн.
//дали е награден (1 = награден, 0 = не е награден)
//Еден студент се наградува доколку има просек еднаков или поголем од 9.5

//INPUT OUTPUT PRIMER
//181021 9 9 10 10 10 8
//
//Prosek: 9.333
//Student: 181021
//5 godina
//Nagraden: 0

#include <stdio.h>

int main() {
    int index, o1, o2, o3, o4, o5, o6;
    scanf("%d%d%d%d%d%d%d", &index, &o1, &o2, &o3, &o4, &o5, &o6);
    float prosek = (o1 + o2 + o3 + o4 + o5 + o6) / 6.0;
    printf("Prosek: %.3f\n", prosek);
    printf("Student: %d\n", index);
    printf("%d godina\n", 23 - index / 10000);
    printf("Nagraden: %d", prosek >= 9.5);
    return 0;
}
