//За еден природен број а велиме дека е порамнување на друг природен број b ако и само ако цифрите еднакви на 9 во бројот b
//се заменети со цифрата 7 во бројот а.
//Пример. Бројот 734775 е порамнување на бројот 934795.
//Од стандарден влез се внесуваат непознат број на цели броеви (не повеќе од 100),
//се додека не се внесе нешто што не може да се интерпретира како цел број.
//Ваша задача е да ги отпечатите најмалите 5 од порамнувањата на сите внесени броеви, по редослед од најмалиот кон најголемиот.
//Забелешка: Доколку се внесат помалку од 5 броеви, тогаш печатите толку броеви колку што се соодветно внесени.
//Наоѓањето на порамнувањето на даден број треба да се реализира во посебна рекурзивна функција poramnet(int a).
//Пример.
//За броевите: 9592, 69403, 100007, 6, 987, 6977, 33439,
//треба да се најдат нивните порамнувања ( тоа се: 7572, 67403, 100007, 6, 787, 6777 и 33437, соодветно),
//и да се отпечатат најмалите 5 од нив по овој редослед: 6 787 6777 7572 33437.
//ЗАБРАНЕТО е користење на глобални променливи.

#include <stdio.h>

int poramnet(int a) {
    if (a == 0) {
        return 0;
    }
    if (a % 10 == 9)
        return 7 + 10 * poramnet(a / 10);
//    else if (a % 10 == 7)
//        return 9 + 10 * poramnet(a / 10);
    else
        return a % 10 + 10 * poramnet(a / 10);
}

void swap(int *a, int *b)
{
    int temp = *a;
    *a = *b;
    *b = temp;
}

void sort(int a[], int n)
{
    for (int i = 0; i<n; i ++)
    {
        int min_el = a[i], min_pos = i;
        for (int j = i+1; j<n; j++)
        {
            if (a[j] < min_el)
            {
                min_el = a[j];
                min_pos = j;
            }
        }
        swap(&a[i], &a[min_pos]);
    }
}

int main() {
    int k, i = 0, n[100];
    while (scanf("%d", &n[i])) {
        n[i] = poramnet(n[i]);
        i++;
    }

    sort(n,i);

    for (int j = 0; j < 5 && j<i; j++) {
        printf("%d ", n[j]);
    }
}