//Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.
//Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број. За секој од нив да се испечати максималната цифра во посебен ред.
//Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.
//Забелешка: ЗАБРАНЕТО е користење на глобални променливи.

#include <stdio.h>
int max(int a) {
    static int m = 0;
    if (a % 10 > m)
    {
        m = a%10;
    }
    if (a > 0)
    {
        return max(a/10);
    } else
    {
        int m1 = m;
        m = 0;
        return m1;
    }
}
int main()
{
    int n;
    while(scanf("%d", &n))
    {
        printf("%d\n", max(n));
    }
    return 0;
}