//Од тастатура се внесуваат димензиите на една матрица (m,n <= 100), а потоа и елементите од матрицата.
//Да се трансформира матрицата така што средниот елемент во секоја редица ќе се замени со разликата (по апсолутна вредност)
//на сумата на елементите во првата половина од редицата и сумата на елементите во втората половина на редицата.
//Ако матрицата има парен број колони, се менува вредноста на средните два елемента.
//Средниот/те елемент/и влегува/ат во сумите (при непарен број на колони, средниот елемент влегува во двете суми!).
//Да се испечати на екран променетата матрица.

#include <stdio.h>
#include <math.h>
#include <stdlib.h>

#define MAX 100


int main() {
    int m, n, mat[MAX][MAX], i, j;
    scanf("%d%d", &m, &n);

    for (i = 0; i < m; i++) {
        for (j = 0; j < n; j++) {
            scanf("%d", &mat[i][j]);
        }
    }

    for (i = 0; i < m; i++) {
        int sum_low = 0, sum_up = 0;
        for (j = 0; j < n; j++) {
            if (j < n / 2)
                sum_low += mat[i][j];
            else
                sum_up += mat[i][j];

        }
        if (n % 2 == 1) {
            sum_low+=mat[i][n/2];
        }

        int end_el = abs(sum_low-sum_up);

        if (n%2==0)
        {
            mat[i][n/2-1]=end_el;
            mat[i][n/2]=end_el;
        } else
        {
            mat[i][n/2]=end_el;
        }
    }
    for (i = 0; i<m; i++)
    {
        for (j = 0; j<n; j++)
        {
            printf("%d ", mat[i][j]);
        }
        printf("\n");
    }
    return 0;
}