//Од стаднарден влез се читаат N низи од знаци (стрингови) не подолги од 80 знаци. На почетокот на програмата се читаат два цели броеви:
//
//N - бројот на низи од знаци кои ќе се читаат и
//X - поместување.
//Секоја од вчитаните низи од знаци треба да се трансформира на тој начин што секоја од малите и големите букви (a-z, A-Z) се заменува со истата буква поместена X места понапред во азбуката (a-z). Ако се надмине опсегот на буквите во азбуката, се продолжува циклично од почетокот на азбуката. Трансформираната низа да се отпечати на СИ.
//
//Трансформацијата да се имплементира со посебна рекурзивна функција.
//
//Пример:
//
//Welcome -> трансформирано со поместување 5 -> Bjqhtrj

#include <ctype.h>
#include <string.h>
#include <stdio.h>

void transform(char *st, int pl) {
    if (pl > 26) {
        pl -= (pl / 26) * 26;
    }
    if (*st == '\0') {
        return;
    } else {
        if (isalpha(*st)) {
            if (isupper(*st))
            {
                if (pl + *st- 'A' >= 26) {
                    *st = *st + pl - 26;
                } else {
                    *st = *st + pl;
                }
            }
           if (islower(*st))
           {
               if (pl + *st - 'a' >= 26) {
                   *st = *st + pl - 26;
               } else {
                   *st = *st + pl;
               }
           }
        }
        return transform(st+1, pl);
    }
}

int main() {
    int n,x;
    scanf("%d%d\n", &n,&x);
    for (int i = 0; i<n; i++)
    {
        char strings[80];
        fgets(strings,80,stdin);
        transform(strings,x);
        printf("%s", strings);
    }
    return 0;
}