//Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100), а потоа се внесува и цел број ind (ind >= 0).
//Да се напише функција sum_pos која ја прима низата, бројот ind (кој претставува индекс во низата) и бројот на валидни елементи во низата.
//Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс ind па се до крајот на низата.
//Ако индексот ind е поголем од N функцијата треба да врати 0.
//
//НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).

#include <stdio.h>
int sum_pos (int *niza, int ind, int n)
{
    int sum_ret = 0;
    if (ind>n)
    {
        return 0;
    } else
    {
        for (ind; ind < n; ind++)
        {
            sum_ret+= *(niza+ind);
        }
    }
    return sum_ret;
}

int main()
{
    int n, ind, arr[100];
    scanf("%d", &n);

    for (int i = 0; i<n; i++)
        scanf("%d",&arr[i]);
    scanf("%d", &ind);
    printf("%d", sum_pos(arr, ind, n));
    return 0;
}