//Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата).
//Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).
//Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100).
//Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
//Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез.
//Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот.
//Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.

#include <stdio.h>

#define MAX 100

int main() {
    int mat[MAX][MAX], n, m, i, j;
    scanf("%d%d", &n, &m);
    for (i = 0; i < n; i++)
        for (j = 0; j < m; j++)
            scanf("%d", &mat[i][j]);

    int r,c;
    scanf("%d%d", &r, &c);

    int sums[4]={0};

    for (i = 0; i<n; i++)
    {
        for (j = 0; j<m; j++)
        {
            if (i < r && j >= c)
                sums[0] += mat[i][j];
            if (i < r && j < c)
                sums[1] += mat[i][j];
            if (i >=r && j < c)
                sums[2] += mat[i][j];
            if (i >= r && j >= c)
                sums[3] += mat[i][j];
        }
    }
    for (i = 0; i<4; i++) printf("%d ", sums[i]);

    return 0;
}