//Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви.
//Да се напише функција void premesti(а, n) која го преместува секој пронајден негативен број на крајот на низата.
//По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа, а истото важи и за редоследот на негативните.
//Нaпишете програма која ќе ја повика функцијата premesti за внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.

#include <stdio.h>

void premesti(int *a, int n)
{
    int tempct = n-1;
    for (int i = n-1; i>=0; i--)
    {
        if (a[i]<0)
        {
            int temp = a[i];
            for (int j = i; j<=tempct; j++)
            {
                a[j] = a[j+1];
            }
            a[tempct] = temp;
            tempct--;
        }
    }
}

int main()
{
    int n,a[100];
    scanf("%d", &n);
    for (int i = 0; i<n; i++)
    {
        scanf("%d", &a[i]);
    }
    premesti(a,n);
    for (int i = 0; i<n; i++)
    {
        printf("%d ", a[i]);
    }
}