//Од стандарден влез да се прочита квадратна матриција со број на редици и колони N. Прво се вчитува бројот N а потоа и N*N елементите на матрицата.
//Да се промени знакот на елементите од главната дијагонала на матрицата (позитивните да станат негативни и обратно).
//Да се испечати трансформираната матрица на екран (Секој елемент од матрицата се печати со 3 места - %3d).

#include <stdio.h>

#define MAX 100

int main() {
    int n,mat[MAX][MAX],i,j;
    scanf("%d", &n);
    for (i=0; i<n; i++)
    {
        for (j=0; j<n; j++)
        {
            scanf("%d", &mat[i][j]);
        }
    }

    for (i =0; i<n; i++)
    {
        mat[i][i] *=-1;
    }

    for (i=0; i<n; i++)
    {
        for (j=0; j<n; j++)
        {
            printf("%3d ", mat[i][j]);
        }
        printf("\n");
    }

    return 0;
}
