//Од стандарден влез се вчитува матрица сo m редици и n колони. Прво се вчитуваат броевите m и n а потоа и елементите на матрицата.
//Да се изврши min-max нормализација на секоја колона од матрицата, односно секој елемент во секоја колона да се замени со вредноста x−min/max−min
//каде што x е елемент во некоја колона, а max и min се соодветно најголемиот и најмалиот елемент во соодветната колона.
//Трансформираната матрица да се испечати на екран.
//Објаснување на примерот:
//Елементите на 0-тата колона се: 1,6,11,16,21. Минимален елемент е 1, а максимален елемент е 21
//Секој од 5те елементи ќе се трансформира на следниот начин:
//(1-1)/(21-1) = 0/20 = 0.00
//(6-1)/(21-1) = 5/20 = 0.25
//(11-1)/(21-1) = 10/20 = 0.50
//(16-1)/(21-1) = 15/20 = 0.75
//(21-1)/(21-1) = 20/20 = 1.00


#include <stdio.h>

int main() {
    int n, m;
    double matrix[100][100];
    scanf("%d%d", &n, &m);
    int i, j;
    for (i = 0; i < n; i++)
        for (j = 0; j < m; j++)
            scanf("%lf", &matrix[i][j]);

    for (i = 0; i < m; i++) {
        double maxcol = matrix[0][i];
        double mincol = matrix[0][i];
        for (j = 0; j < n; j++) {
            if (matrix[j][i] > maxcol) {
                maxcol = matrix[j][i];
            }
            if (matrix[j][i] < mincol) {
                mincol = matrix[j][i];
            }
        }

        for (j = 0; j < n; j++) {
            matrix[j][i] = (matrix[j][i] - mincol) / (maxcol - mincol);
        }
    }

    for (i = 0; i < n; i++) {
        for (j = 0; j < m; j++) {
            printf("%.2lf ", matrix[i][j]);
        }
        printf("\n");
    }
    return 0;
}
