//Напишете програма за читање елементи во матрица и проверете дали дадената матрица е симетрична матрица или не.
//Од стандаред влез се внесуваат димензиите на матрицата M и N соодветно и потоа се внесуваат елементите на матрицата.
//Ваша задача е доколку матрицата е симетрична да испечатете на екран 1, доколку не е симетрична да испечатете -1, потоа се печати самата матрица на екран.

#include <stdio.h>

#define MAX 100

int main() {
    int n, m, mat[MAX][MAX], i, j;
    scanf("%d%d", &m,&n);

    for (i = 0; i < m; i++) {
        for (j = 0; j < n; j++) {
            scanf("%d", &mat[i][j]);
        }
    }

    int sym = 1;

    for (i = 0; i<n; i++)
    {
        for (j = 0; j<n; j++)
        {
            if (mat[i][j] != mat[j][i])
            {
                sym = -1;
                break;
            }
        }
    }

    printf("%d\n", sym);

    for (i = 0; i < m; i++) {
        for (j = 0; j < n; j++) {
            printf("%d ", mat[i][j]);
        }
        printf("\n");
    }

    return 0;
}
