//Од стандарден влез се вчитува квадратна матрица со n редици и колони. Прво се вчитува бројот n, па потоа и n елементите на матрицата.
//
//Доколку n е непарен број да се испечати пораката GRESKA и да заврши програмата.
//
//Потребно е матрицата да се здипли како што е прикажано на сликата. При диплење на матрицата, се собираат елементите на позициите што се поклопуваат при диплењето.

#include <stdio.h>

#define MAX 100

int main() {
    int n, mat[MAX][MAX], i, j;
    scanf("%d", &n);
    if (n % 2) {
        printf("GRESKA");
        return 0;
    }
    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            scanf("%d", &mat[i][j]);
        }
    }

    for (i = 0; i < n / 2; i++) {
        for (j = 0; j < n; j++) {
            mat[i][j] += mat[n - i - 1][j];
        }
    }

    for (i = 0; i < n / 2; i++) {
        for (j = 0; j < n / 2; j++) {
            mat[i][j] += mat[i][n - j - 1];
        }
    }

    for (i = 0; i < n / 2; i++) {
        for (j = 0; j < n / 2; j++) {
            printf("%d ", mat[i][j]);
        }
        printf("\n");
    }

    return 0;
}
