//Имате купено нова игра која ги има следните правила:
//-Кога ќе заврши играта добивате P1 поени за секое поминато ниво
//-Но, доколку имате поминато над C1 нивоа тогаш добивате P2 поени (наместо P1) за секое ниво
//-Но, доколку имате поминато над C2 (C2>C1) нивоа тогаш добивате P3 поени (наместо P2) за секое ниво
//
//На пример нека P1 = 100; C1 = 3; P2 = 150; C2 = 6; и P3 = 200. Тогаш за
//-изиграни 2 нивоа ќе добиете 2*P1 = 200 поени
//-изиграни 4 нивоа ќе добиете 4*P2 = 600 поени
//-изиграни 6 нивоа ќе добиете 6*P2 = 900 поени
//-изиграни 8 нивоа ќе добиете 8*P3 = 1600 поени
//Вие ја играте играта 3 пати, при што сте поминале A нивоа првиот пат, потоа играјќи повторно од почеток сте поминале B нивоа вториот пат и третиот пат сте поминале C нивоа.
//
//Напишете програма која за дадени вредности P1, C1, P2, C2, P3; и дадени A, B и C ќе пресмета и ќе отпечати колку вкупно поени имате добиено при играњето.

#include <stdio.h>

int main() {
    int p1, c1, p2, c2, p3;
    int a, b, c, poenia = 0, poenib = 0, poenic = 0;
    scanf("%d%d%d%d%d", &p1, &c1, &p2, &c2, &p3);
    scanf("%d%d%d", &a, &b, &c);

    if (a <= c1) {
        poenia += p1 * a;
    } else if (a > c1 && a <= c2) {
        poenia += p2 * a;
    } else if (a > c2) {
        poenia += p3 * a;
    }

    if (b <= c1) {
        poenib += p1 * b;
    } else if (b > c1 && b <= c2) {
        poenib += p2 * b;
    } else if (b > c2) {
        poenib += p3 * b;
    }

    if (c <= c1) {
        poenic += p1 * c;
    } else if (c > c1 && c <= c2) {
        poenib += p2 * c;
    } else if (c > c2) {
        poenib += p3 * c;
    }

    printf("%d", poenia + poenib + poenic);
    return 0;
}
