//Цик-цак е број за кој што важи дека за секој пар соседни цифри, тие се наизменично поголеми односно помали една во однос на друга.
//На пример, ако бројот x е составен од цифрите a, b, c, d и е, тогаш за нив важи:
//a>b, b<c, c>d, d<e или a<b, b>c, c<d, d>e
//Пр. 343, 4624, 6231209
//Од тастатура се читаат непознат број цели броеви поголеми од или еднакви на 10 (броевите помали од 10 се игнорираат).
//Читањето завршува во моментот кога ќе се прочита знак што не е цифра.
//Да се испечатат сите цик-цак броеви.

#include <stdio.h>

int main() {

    int n;
    while (scanf("%d", &n)) {
        if (n < 10) {
            continue;
        } else {
            int ncpy = n, flag = 0;
            if (ncpy % 10 > ncpy / 10 % 10) // pogolemo od kraj, flag 1, pomalo od kraj flag 0
            {
                flag = 1;
            }

            while (ncpy >= 10) {
                if (flag == 0) {
                    if (ncpy % 10 < ncpy / 10 % 10) {
                        flag = 1;
                    } else {
                        break;
                    }
                } else if (flag == 1) {
                    if (ncpy % 10 > ncpy / 10 % 10) {
                        flag = 0;
                    } else {
                        break;
                    }

                }
                ncpy /= 10;
            }
            if (ncpy < 10) {
                printf("%d\n", n);
            }
        }
    }

    return 0;
}
