/*
 * Цик-цак е број за кој важи дека за секој пар соседни цифри во бројот важи дека едната е помала од 5, а другата е поголема или еднаква на 5.
 * На пример, ако бројот x е составен од цифрите a, b, c и d, тогаш за нив важи:
 * a<5, b>=5, c<5, d>=5 или a>=5, b<5, c>=5, d<5
 * Пр.  508294, 2638, 81
 * Од тастатура се читаат непознат број на цели броеви поголеми од или еднакви на 10 (броевите помали од 10 се игнорираат).
 * Читањето завршува во моментот кога ќе се прочита знак што не е цифра.
 * Да се испечатат сите цик-цак броеви.
 */
#include <stdio.h>

int main() {

    int n;
    while (scanf("%d", &n)) {
        if (n <= 10) {
            continue;
        } else {
            int ncpy = n, flag = 0,flagf5;
            if (ncpy % 10 >= 5) // pogolemo od kraj, flag 1, pomalo od kraj flag 0
            {
                flag = 1;
            }

            while (ncpy >= 10) {
                if (flag == 0) {
                    if (ncpy % 10 < 5) {
                        flag = 1;
                    } else {
                        break;
                    }
                } else if (flag == 1) {
                    if (ncpy % 10 >= 5 && ncpy/10%10 !=5) {
                        flag = 0;
                    } else {
                        break;
                    }
                }
                ncpy /= 10;
            }
            if (ncpy < 10) {
                printf("%d\n", n);
            }
        }
    }

    return 0;
}
