//Од тастатура се внесува број на студенти кои ќе полагаат колоквиум, а потоа и индексите (цели броеви) на сите студенти кои ќе полагаат колоквиум.
//Програмата треба да ги подели студентите во три групи: студенти со индекси кои завршуваат на цифрата 0, 1 и 2,
//студенти со индекси кои завршуваат на цифрата 3, 4, 5 и студенти со индекси кои завршуваат на цифрата 6, 7, 8, 9.
//Програмата треба да ги испечати индексите за секоја група, во истиот редослед како што биле внесени. Максималниот број на студенти што може да се внесат е 1000.

#define MAX 1000
#include <stdio.h>

int main()
{
    int stud[MAX], n, i;
    scanf("%d", &n);
    for (i = 0; i<n; i++)
    {
        scanf("%d", &stud[i]);
    }

    printf("Grupa 1\n");
    for (i = 0; i<n; i++)
    {
        if (stud[i]%10 >= 0 && stud[i]%10 <=2)
        {
            printf("%d ", stud[i]);
        }
    }

    printf("\nGrupa 2\n");
    for (i = 0; i<n; i++)
    {
        if (stud[i]%10 >= 3 && stud[i]%10 <=5)
        {
            printf("%d ", stud[i]);
        }
    }


    printf("\nGrupa 3\n");
    for (i = 0; i<n; i++)
    {
        if (stud[i]%10 >=6 && stud[i]%10 <=9)
        {
            printf("%d ", stud[i]);
        }
    }
    return 0;
}
