//Од тастатура се читаат непознат број позитивни цели броеви се додека не се внесе нешто различно од број. За секој број треба да се пресмета збирот на цифрата
//со максимална вредност од претходно внесениот број и сумата на цифрите на тековниот број (за првиот внесен број се пресметува само сумата на неговите цифри).
//За секој внесен број резултатот треба да се испечати во следниот формат:
//[број]: [сумата на цифрите на бројот + максималната цифра од претходниот број]
//342: 9   //3+4+2
//345: 16 //3+4+5+4
//123: 11 //1+2+3+5
//456: 18 //4+5+6+3

#include <stdio.h>
int main()
{
    int k, maxdigit, i=0, prevmaxdigit;
    while (scanf("%d", &k))
    {
        int tempsum = k%10, korg = k;
        maxdigit = k%10;
        k/=10;
        while (k>0)
        {
            tempsum += k%10;
            if (k%10 > maxdigit)
            {
                maxdigit = k%10;
            }
            k/=10;
        }

        if (i == 0)
        {
            i++;
        } else
        {
            tempsum+=prevmaxdigit;
        }
        prevmaxdigit = maxdigit;
        printf("%d: %d\n",korg, tempsum);
    }
    return 0;
}
