/*
 * Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.
 * Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
 * Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.
 * Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)
 * */
#include <stdio.h>

int main() {
    int a,b;
    scanf("%d%d", &a,&b);

    if (a <= 0 || b <= 0)
    {
        printf("Invalid input");
        return 0;
    } else
    {
        if (a<b)
        {
            int pom = b;
            b = a;
            a = pom;
        }
        int acpy = a, bcpy = b;
        while(bcpy != 0 && acpy != 0)
        {
            if (bcpy%10 == acpy/10%10)
            {
                bcpy/=10;
                acpy/=100;
            } else
            {
                printf("NE");
                return 0;
            }
        }
    }

    printf("PAREN");
    return 0;
}
