/*
 * Од стандарден влез се внесуваат два цели броја N и Х.
 * Да се најде најблискот број помал од N коj е тотално различен од бројот Х.
 * Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.
 * Задачата да се реши без употреба на низи и матрици.
 * */
#include <stdio.h>

int main() {
    int n,x, i;
    scanf("%d%d", &n, &x);
    n--;

    for (int i = n; i>=0; i--)
    {
        int xcpy = x, icpy, raz = 1;
        while (xcpy > 0)
        {
            icpy = i;
            while (icpy)
            {
                if (xcpy%10 != icpy%10)
                {
                    icpy/=10;
                } else
                {
                    raz = 0;
                    break;
                }
            }
            xcpy/=10;
        }
        if (raz == 1) {
            printf("%d", i);
            return 0;
        }
    }
    return 0;

}
