//Empires & Allies е стратегиска игра во повеќе нивоа со можност за играње од
//страна на повеќе играчи. Секој играч има своја територија, како и одбранбени
//и напаѓачки единици. Може да влезе во битка (напад на туѓа територија или
//одбрана на сопствената) со други играчи што може да заврши со победа или
//пораз за што се добиваат поени. Да се напише програма во која од тастарура се
//внесува бројот на играчи на играта Empires & Allies. За секој играч потоа се
//внесуваат податоци за ниво (цел број), број на победи и број на порази.
//Резултатот на играчот се пресметува на следниот начин:
//• ако се работи за прво ниво, секоја победа носи 13 поени, а секој пораз носи -1 поен
//• ако се работи за второ ниво, секоја победа носи 13 поени, а секој пораз носи -3 поени
//
//За секој играч треба да се испечати Dobar igrac ако неговиот број на поени е
//позитивен или Los igrac во сите други случаи. Потоа треба да се најде и
//испечати најдобриот резултат (најголемиот вкупен број на поени), како и
//редниот број на играчот со најдобар резултат (првиот играч е со реден број
//еден, вториот со реден број два итн.). Ако постојат повеќе играчи со ист
//најдобар резултат, да се испечати редниот број на првиот таков играч.

#include <stdio.h>
int main()
{
    int n, i, redbr = 0, maxp;
    scanf("%d", &n);
    for (i = 1; i<=n; i++)
    {
        int nivo, p, z, poeni = 0;
        scanf("%d%d%d", &nivo, &p, &z);
        if (nivo == 1)
        {
            poeni = p*13 - z;
        } else if (nivo == 2)
        {
            poeni = p*13 - 3*z;
        }

        if (poeni < 0)
        {
            printf("Losh igrac");
        } else
        {
            printf("Dobar igrac");
        }

        if (i == 1)
        {
            maxp = poeni;
            redbr = i;
        } else
        {
            if (maxp < poeni)
            {
                maxp = poeni;
                redbr = i;
            }
        }

    }
    printf("\n%d %d", maxp, redbr);
}