//Од тастатура се внесува цел број n, а потоа и n тројки природни броеви
//(должини на три отсечки). За секоја тројка должини треба да се испечати
//порака Moze ако со нив може да се конструира триаголник, во спротивно се
//печати Ne moze. На крај да се испечати редниот број на тројката броеви со која
//се конструира триаголникот со најголем периметар (се земаат предвид само
//тројките со кои може да се конструира триаголник), како и вредноста на
//најголемиот периметар. Ако постојат повеќе такви тројки броеви, да се
//испечати редниот број на последната. Се смета дека првата внесена тројка е со
//реден број еден, втората со реден број два итн.

#include <stdio.h>
int main()
{
    int n,i, maxl=0, mozebr = 0;
    scanf("%d", &n);
    for(i = 1; i<=n; i++) {
        int a, b, c, l = 0;
        scanf("%d%d%d", &a, &b, &c);
        if (a + b > c && a + c > b && b + c > a) {
            l = a + b + c;
            printf("Moze\n");
                if (maxl < l)
                {
                    maxl = l;
                    mozebr = i;
                }
            }
        else
        {
            printf("Ne moze");

        }
    }
    printf("%d %d", maxl, mozebr);
    return 0;

}