//Од тастатура се внесуваат два цели броеви X и N. Пoтоа од тастатура се внесуваат уште N природни броеви поголеми од 9.
//Секој внесен број да се трансформира во број којшто е добиен со преместување на неговата најзначајна (прва) цифра на крајот од бројот.
//Потоа да се провери дали Х е делител на добиениот број и на екран да се испечати DA ако е делител и NE во спротивно (за секој број во посебен ред).
//(Пример за преместување на најзначајната (прва) цифра на крај на број: 1234 -> 2341, 10 -> 1, 200 -> 2 )
//Пр. Влез 2 2 43 100
//Излез DA NE
//(Објаснување за примерот: 43 -> 34, 2 e делител на 34 100 -> 1, 2 НЕ е делител на 1 )

#include <stdio.h>

int main()
{
    int x,n,i;
    scanf("%d%d",&x,&n);
    for (i = 0; i<n; i++)
    {
        int k,coeff=1,korg;
        scanf("%d", &k);
        korg=k;
        while (k>=10)
        {
            coeff*=10;
            k/=10;
        }
        int fD = korg / coeff;
        int oD = korg % coeff;
        int finN = oD*10 + fD;

        if (finN % x == 0)
        {
            printf("DA\n");
        } else
        {
            printf("NE\n");
        }
    }
    return 0;
}
