//Од тастатура се внесуваат два едноцифрени броја C1 и C2 (1 <= C1, C2 <= 9).
//Потоа се внесува природен број N, кој означува колку броеви ќе се внесат во продолжение.
//Потоа се внесуваат N-те природни броеви. За секој од внесените броеви програмата треба да го испечати бројот
// кај кој цифрата C1 од внесениот број е заменетa со цифра C2, како и неговиот следбеник.

#include <stdio.h>

int main() {
    int c1,c2,n,i;
    scanf("%d%d%d", &c1,&c2,&n);
    for (i = 0; i<n; i++)
    {
        int br, zbir = 0, koef = 1;
        scanf("%d", &br);
        while (br)
        {
            if (br%10==c1)
            {
                zbir+=c2*koef;
            } else
            {
                zbir+=(br%10)*koef;
            }
            koef*=10;
            br/=10;
        }
        printf("%d %d\n", zbir, ++zbir);
    }
    return 0;
}